# Python_2. HW_1
# 1) Создать переменную типа String
a = "tina"
print(type(a), a)

# 2) Создать переменную типа Integer

i = 9
print(type(i), i)

# 3) Создать переменную типа Float

f = 1.2
print(type(f), f)

# 4) Создать переменную типа Bytes

b = b'bytes'
print(type(b), b)

# 5) Создать переменную типа List

l = [a, b, f]
print(type(l), l)

# 6) Создать переменную типа Tuple

a = (1, 2, 3)
print(type(a), a)

# 7) Создать переменную типа Set

s = set("привет,как дела?")
print(type(s), s)

# 8. Создать переменную типа Frozen set

f = frozenset('11212132')
print(type(f), f)

# 9) Создать переменную типа Dict

d = {'n': "hello"}
print(type(d), d)

# 10) Вывести в консоль все выше перечисленные переменные с добавлением типа данных.

# 11) Создать 2 переменные String, создать переменную в которой сканкатенируете эти переменные. Вывести в консоль.

a = ("luna")
n = ("lu")
print(a + n)

# 12) Вывести в одну строку переменные типа String и Integer используя “,” (Запятую)

print(a , i)

# 13) Вывести в одну строку переменные типа String и Integer используя “+” (Плюс)

print(str(i) + a)

# x =2
# y=4
# z=x*y
# print(f'при умножении {x} на {y} получаем {z}')
